Aymann00/STM32F446xx-Drivers/MCAL/USART/Src/USART_Program.c
/*
 ******************************************************************************
 * @file           : USART_Program.c
 * @Author         : Mohammed Ayman Shalaby
 * @brief          : Main program body
 * @Date           : Aug 17, 2023
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 Ayman.
 * All rights reserved.
 *
 ******************************************************************************
 */

/*==============================================================================================================================================
 * INCLUDES SECTION START
 *==============================================================================================================================================*/

#include <stdint.h>

#include "../../../LIB/STM32F446xx.h"
#include "../../../LIB/ErrType.h"

#include "../Inc/USART_Interface.h"
#include "../Inc/USART_Config.h"
#include "../Inc/USART_Private.h"

/*==============================================================================================================================================
 * INCLUDES SECTION END
 *==============================================================================================================================================*/

/*==============================================================================================================================================
 * GLOBAL VARIABLES SECTION START
 *==============================================================================================================================================*/

static USART_RegDef_t *USART[USART_MAX_NUMBER] = {USART1, USART2, USART3, UART4, UART5, USART6};

static void (*USART_PTR_TO_FUNC[USART_MAX_NUMBER][USART_IT_NUM])(void) = {NULL};

static uint16_t *USART_ReceivedData[USART_MAX_NUMBER] = {NULL};

static uint8_t *USART_SentBuffer[USART_MAX_NUMBER] = {NULL};

static uint8_t *USART_ReceivedBuffer[USART_MAX_NUMBER] = {NULL};

static uint8_t USART_SentbufferSize[USART_MAX_NUMBER] = {0};

static uint8_t USART_ReceivebufferSize[USART_MAX_NUMBER] = {0};

static USART_IRQ_SRC_t IRQ_SRC[USART_MAX_NUMBER] = {USART_NO_SRC};
/*==============================================================================================================================================
 * GLOBAL VARIABLES SECTION END
 *==============================================================================================================================================*/

/*==============================================================================================================================================
 * MODULES IMPLEMENTATION
 *==============================================================================================================================================*/

/**
 * @brief  : This Function is Used to Read A Specific USART Flag
 *
 * @param  : USART_Type => This Parameter is Used to Select The USART Peripheral Number to Be Used -> @USART_t
 * @param  : Flag       => This Parameter is Used to Select The Flag to Be Read -> @USART_Flag_t
 * @param  : FlagState  => This Parameter is Used to Store The Flag State As a Return  -> @USART_FlagStatus_t
 * @return : ERRORS_t   => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
ERRORS_t USART_ReadFlag(USART_t USART_Type, USART_Flag_t Flag, USART_FlagStatus_t *FlagState)
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

	if (USART_Type < USART_PERIPH_1 || USART_Type > USART_PERIPH_6 ||
		Flag < USART_PARITY_ERROR || Flag > USART_CTS_TOGGLE)
	{
		Local_u8ErrorStatus = USART_NOK;
	}
	else
	{
		/* Configurations Are OK */

		*FlagState = ((USART[USART_Type]->SR >> Flag) & 1);
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Initialize a Specific USART Peripheral
 * @fn     : USART_Init
 * @param  : USART_Config => This Parameter is Used to Pass The Configuration Struct to Initialize The USART Peripheral
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
ERRORS_t USART_Init(USART_Config_t *USART_Config)
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

	if (USART_WRONG_CONFIGURATION != USART_CheckConfig(USART_Config))
	{
		/* Correct Configurations are Handled */

		/* Enable USART */
		USART[USART_Config->USART_Number]->CR1 |= (1 << UE);

		/* Set OverSampling Rate */
		USART[USART_Config->USART_Number]->CR1 &= (USART_OVER8_MASK);
		USART[USART_Config->USART_Number]->CR1 |= (USART_Config->Oversampling << OVER8);

		/* Set Word Length */
		USART[USART_Config->USART_Number]->CR1 &= (USART_M_MASK);
		USART[USART_Config->USART_Number]->CR1 |= (USART_Config->WordLength << M);

		/* Set Parity Mode Selected */
		USART_SetParity(USART_Config->USART_Number, USART_Config->ParityMode);

		/* Set All Configured Interrupt to there Initial States */
		USART_EnableIT(USART_Config);

		/* Set Stop Bits */
		USART[USART_Config->USART_Number]->CR2 &= (USART_STOP_MASK);
		USART[USART_Config->USART_Number]->CR2 |= (USART_Config->StopBits << STOP);

		/* Set BaudRate */
		USART_SetBaudRate(USART_Config);

		/* Set HW Flow Control */
		if (USART_Config->HW_FlowControlMode == USART_HW_FLOW_CTRL_DIS)
		{
			USART[USART_Config->USART_Number]->CR3 &= (~((1 << CTSE) | (1 << RTSE)));
		}
		else
		{
			/* Enable Both RTS & CTS */
			USART[USART_Config->USART_Number]->CR3 |= (1 << CTSE) | (1 << RTSE);
		}

		/* Set USART Mode */
		USART_SetMode(USART_Config->USART_Number, USART_Config->Mode);
	}
	else
	{
		Local_u8ErrorStatus = USART_NOK;
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Receive Data Using a USART Peripheral ( Blocking Mode )
 *
 * @param  : config   => This Parameter is Used to Pass The Configuration Struct to Use it to Receive Data
 * @param  : ReceivedData     => This Parameter is Used to Return The Received Data From The USART Peripheral
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
ERRORS_t USART_ReceiveData(USART_Config_t *config, uint16_t *ReceivedData)
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

	USART_FlagStatus_t FlagState = USART_FLAG_RESET;

