Aymann00/STM32F446xx-Drivers/MCAL/USART/Src/USART_Program.c
	if (NULL != ReceivedData)
	{

		while (USART_FLAG_SET != FlagState)
		{
			USART_ReadFlag(config->USART_Number, USART_RDATA_REG_NEMPTY, &FlagState);
		}

		*ReceivedData = USART[config->USART_Number]->DR;

		if (USART_PARITY_DIS != config->ParityMode)
		{
			/* Parity is Enabled */
			if (config->WordLength == USART_8_BITS_WIDTH)
			{
				/* Clear Parity Bit */
				*ReceivedData &= (USART_CLEAR_PARITY_8_MASK);
			}
			else if (config->WordLength == USART_8_BITS_WIDTH)
			{
				/* Clear Parity Bit */
				*ReceivedData &= (USART_CLEAR_PARITY_9_MASK);
			}
		}
	}
	else
	{
		Local_u8ErrorStatus = NULL_POINTER;
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Send Data Using a USART Peripheral ( Blocking Mode )
 *
 * @param  : Config => This Parameter is Used to Pass The Configuration Struct to Send Data Using it
 * @param  : Data   => This Parameter is Used to Pass The Data to Be Sent Using The USART Peripheral
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
ERRORS_t USART_SendData(USART_Config_t *Config, uint16_t Data)
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

	USART_FlagStatus_t FlagStatus = USART_FLAG_RESET;

	if (USART_WRONG_CONFIGURATION != USART_CheckConfig(Config))
	{
		/* Configurations are OK */

		/* Wait Until Transmission Data Register Empty Flag is Set */

		while (USART_FLAG_SET != FlagStatus)
		{
			USART_ReadFlag(Config->USART_Number, USART_TDATA_REG_EMPTY, &FlagStatus);
		}

		/* Send Data */
		USART[Config->USART_Number]->DR = Data;

		/* Wait Untill Transmission Complete Flag is Set */
		FlagStatus = USART_FLAG_RESET;

		while (USART_FLAG_SET != FlagStatus)
		{
			USART_ReadFlag(Config->USART_Number, USART_TRANSMISSION_COMP, &FlagStatus);
		}
	}
	else
	{
		Local_u8ErrorStatus = USART_NOK;
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is to Set CallBack Function to be Used in Interrupt Mode For a Specifiic Interrupt Type
 * @fn     : USART_SetCallBack
 * @param  : Config => This Parameter is Used to Pass The Configuration Struct to Send String Using it
 * @param  : ITNumber   => This Parameter is Used to Pass The Interrupt Type to Set CallBack Function For it
 * @param  : Pv_CallBackFunc   => This Parameter is Used to Pass The CallBack Function to be Used in Interrupt Mode
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 * @note   : This Function Can Be Used Individually if Function You are calling use Interrupt Mode ( asycnchronous ) & Call Back Function is not One of It's
 * 		 Arguments
 */
ERRORS_t USART_SetCallBack(USART_t USARTNum, USART_IT_t ITNumber, void (*Pv_CallBackFunc)(void))
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

	if (USARTNum < USART_PERIPH_1 || USARTNum > USART_PERIPH_6 ||
		ITNumber < USART_IT_PE || ITNumber > USART_IT_EIE)
	{
		Local_u8ErrorStatus = USART_NOK;
	}
	else
	{
		if (NULL != Pv_CallBackFunc)
		{
			USART_PTR_TO_FUNC[USARTNum][ITNumber] = Pv_CallBackFunc;
		}
		else
		{
			Local_u8ErrorStatus = NULL_POINTER;
		}
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Receive Data Using a USART Peripheral ( Non-Blocking Mode ) AKA Asycnchronous
 * @fn     : USART_SendData_IT
 * @param  : Config => This Parameter is Used to Pass The Configuration Struct to Send Data Using it
 * @param  : Data   => This Parameter is Used to Pass The Variable to Be Received inside it
 * @param  : pv_CallBackFunc   => This Parameter is Used to Pass The CallBack Function to be Used in Interrupt Mode
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
ERRORS_t USART_ReceiveData_IT(USART_Config_t *Config, uint16_t *ReceivedData, void (*pv_CallBackFunc)(void))
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

	if ((NULL != ReceivedData) && (NULL != pv_CallBackFunc))
	{
		/* Setting IRQ Source */
		IRQ_SRC[Config->USART_Number] = USART_RECEIVE_DATA;

		/* Setting Global Variable */
		USART_ReceivedData[Config->USART_Number] = ReceivedData;

		/* Setting Call Back Function */
		USART_PTR_TO_FUNC[Config->USART_Number][USART_IT_RXNE] = pv_CallBackFunc;

		/* Enable Read Data Register Not Empty Interrupt */
		USART[Config->USART_Number]->CR1 |= (1 << RXNEIE);
	}
	else
	{
		Local_u8ErrorStatus = NULL_POINTER;
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Send String Using a USART Peripheral ( Non-Blocking Mode )
 * @fn     : USART_SendBuffer
 * @param  : Config => This Parameter is Used to Pass The Configuration Struct to Send String Using it
 * @param  : Data   => This Parameter is Used to Pass The Buffer of Data to Be Sent Using The USART Peripheral
 * @param  : Size   => This Parameter is Used to Pass The Size of The Buffer to Be Sent Using The USART Peripheral
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
ERRORS_t USART_SendBuffer(USART_Config_t *Configuration, uint8_t *Data, uint8_t Size)
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

	uint8_t Local_u8Counter = 0;

	if ((NULL != Configuration) && (NULL != Data))
	{
		for (Local_u8Counter = 0; Local_u8Counter < Size; Local_u8Counter++)
		{
			USART_SendData(Configuration, (uint16_t)Data[Local_u8Counter]);
		}
	}
	else
	{
		Local_u8ErrorStatus = NULL_POINTER;
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Receive String Using a USART Peripheral ( Blocking Mode )
 * @fn     :  USART_ReceiveBuffer
 * @param  : Config => This Parameter is Used to Pass The Configuration Struct to Receive String Using it
 * @param  : ReceivedData   => This Parameter is Used to Pass The Buffer of Data to Be Received inside it Using The USART Peripheral
 * @param  : Size   => This Parameter is Used to Pass The Size of The Buffer to Be Received Using The USART Peripheral
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
ERRORS_t USART_ReceiveBuffer(USART_Config_t *Config, uint8_t *ReceivedData, uint8_t Size)
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

