Aymann00/STM32F446xx-Drivers/MCAL/USART/Src/USART_Program.c
	uint8_t Local_u8Counter = 0;

	if ((NULL != Config) && (NULL != ReceivedData))
	{
		for (Local_u8Counter = 0; Local_u8Counter < Size; Local_u8Counter++)
		{
			USART_ReceiveData(Config, (uint16_t *)&ReceivedData[Local_u8Counter]);
		}
	}
	else
	{
		Local_u8ErrorStatus = NULL_POINTER;
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Enable DMA Receiver
 * @fn     : USART_EnableDMAReceiver
 * @param  : Config => This Parameter is Used to Pass The Configuration Struct to Enable DMA Receiver
 * @return :  ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
ERRORS_t USART_EnableDMAReceiver(USART_Config_t *Config)
{
	ERRORS_t Local_u8ErrorState = USART_OK;

	if (USART_WRONG_CONFIGURATION != USART_CheckConfig(Config))
	{
		USART[Config->USART_Number]->CR3 |= (1 << DMAR);
	}
	else
	{
		Local_u8ErrorState = NOK;
	}
	return Local_u8ErrorState;
}

/**
 * @brief  : This Function is Used to Enable DMA Transmitter
 * @fn     : USART_EnableDMATransmitter
 * @param  : Config => This Parameter is Used to Pass The Configuration Struct to Enable DMA Transmitter
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
ERRORS_t USART_EnableDMATransmitter(USART_Config_t *Config)
{
	ERRORS_t Local_u8ErrorState = USART_OK;

	if (USART_WRONG_CONFIGURATION != USART_CheckConfig(Config))
	{
		USART[Config->USART_Number]->CR3 |= (1 << DMAT);
	}
	else
	{
		Local_u8ErrorState = NOK;
	}
	return Local_u8ErrorState;
}

/**
 * @brief  : This Function is Used to Enable USART Interrupts
 *
 * @param  : Config => This Parameter is Used to Pass The Configuration Struct to Enable The Interrupts
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 * @note   : This Function is Used Inside USART_Init Function to Enable Interrupts , you can use it to Enable Interrupts Individually
 */
ERRORS_t USART_EnableIT(USART_Config_t *Config)
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

	if (USART_WRONG_CONFIGURATION == USART_CheckConfig(Config))
	{
		Local_u8ErrorStatus = USART_NOK;
	}
	else
	{
		/* Set Parity Error Interrupt */
		USART[Config->USART_Number]->CR1 &= (USART_PEIE_MASK);
		USART[Config->USART_Number]->CR1 |= (Config->IT_FlagEnable.ParityErrorIT << PEIE);

		/* Set Transmit Data Register Empty Interrupt */
		USART[Config->USART_Number]->CR1 &= (USART_TXEIE_MASK);
		USART[Config->USART_Number]->CR1 |= (Config->IT_FlagEnable.TDataRegEmptyIT << TXEIE);

		/* Set Transmission Complete Interrupt */
		USART[Config->USART_Number]->CR1 &= (USART_TCIE_MASK);
		USART[Config->USART_Number]->CR1 |= (Config->IT_FlagEnable.TransmissionCompleteIT << TRANS_CIE);

		/* Set Receive Data Register Not Empty Interrupt */
		USART[Config->USART_Number]->CR1 &= (USART_RXNEIE_MASK);
		USART[Config->USART_Number]->CR1 |= (Config->IT_FlagEnable.RDataRegNEmptyIT << RXNEIE);

		/* Set IDLE Line Detected Interrupt */
		USART[Config->USART_Number]->CR1 &= (USART_IDLEIE_MASK);
		USART[Config->USART_Number]->CR1 |= (Config->IT_FlagEnable.IDLELineDetectedIT << IDLEIE);

		/* Set LIN Break Detection Interrupt */
		USART[Config->USART_Number]->CR2 &= (USART_LBDIE_MASK);
		USART[Config->USART_Number]->CR2 |= (Config->IT_FlagEnable.LINBreakDetectedIT << LBDIE);

		/* Set CTS Interrupt */
		USART[Config->USART_Number]->CR3 &= (USART_CTSIE_MASK);
		USART[Config->USART_Number]->CR3 |= (Config->IT_FlagEnable.CTSIT << CTSIE);

		/* Set Error Interrupt */
		USART[Config->USART_Number]->CR3 &= (USART_EIE_MASK);
		USART[Config->USART_Number]->CR3 |= (Config->IT_FlagEnable.ErrorIT << EIE);
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Send Data Using a USART Peripheral ( Non-Blocking Mode ) AKA Asycnchronous
 * @fn     : USART_SendData_IT
 * @param  : Configuration => This Parameter is Used to Pass The Configuration Struct to Send Data Using it
 * @param  : Data => This Parameter is Used to Pass The Data to Be Sent Using The USART Peripheral
 * @param  : pv_CallBack_Func => This Parameter is Used to Pass The CallBack Function to be Used in Interrupt Mode to be invoked when Interrupt Occurs
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
ERRORS_t USART_SendData_IT(USART_Config_t *Configuration, uint16_t Data, void (*pv_CallBack_Func)(void))
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

	if ((USART_WRONG_CONFIGURATION != USART_CheckConfig(Configuration)) && (NULL != pv_CallBack_Func))
	{
		/* Correct Cofiguration */

		/* Setting IRQ_SRC */
		IRQ_SRC[Configuration->USART_Number] = USART_SEND_DATA;

		/* Setting Call Back Function */
		USART_PTR_TO_FUNC[Configuration->USART_Number][USART_IT_TC] = pv_CallBack_Func;

		/* Send Data */
		USART[Configuration->USART_Number]->DR = Data;

		/* Enable Transmission Complete Interrupt */
		USART[Configuration->USART_Number]->CR1 |= (1 < TRANS_CIE);
	}
	else
	{
		Local_u8ErrorStatus = USART_NOK;
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Send String Using a USART Peripheral ( Non-Blocking Mode ) AKA Asycnchronous
 * @fn     : USART_SendBuffer_IT
 * @param  : Config  => This Parameter is Used to Pass The Configuration Struct to Send String Using it
 * @param  : DataBuffer => This Parameter is Used to Pass The Buffer of Data to Be Sent Using The USART Peripheral
 * @param  : BufferSize => This Parameter is Used to Pass The Size of The Buffer to Be Sent Using The USART Peripheral
 * @param  : pv_CallBackFunc => This Parameter is Used to Pass The CallBack Function to be Used in Interrupt Mode to be invoked when Interrupt Occurs
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
ERRORS_t USART_SendBuffer_IT(USART_Config_t *Config, uint8_t *DataBuffer, uint8_t BufferSize, void (*pv_CallBackFunc)(void))
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

	USART_FlagStatus_t FlagState = USART_FLAG_RESET;

	if (USART_WRONG_CONFIGURATION != USART_CheckConfig(Config))
	{
		if (DataBuffer != NULL && pv_CallBackFunc != NULL)
		{
			/* Setting IRQ Source */
			IRQ_SRC[Config->USART_Number] = USART_SEND_BUFFER;

			/* Setting Buffer to Send Globaly */
			USART_SentBuffer[Config->USART_Number] = DataBuffer;

			/* Setting Buffer Size Globaly */
			USART_SentbufferSize[Config->USART_Number] = BufferSize;

			/* Setting Call Back Function */
			USART_PTR_TO_FUNC[Config->USART_Number][USART_IT_TC] = pv_CallBackFunc;

			/* Send First Character */
			while (USART_FLAG_SET != FlagState)
			{
				USART_ReadFlag(Config->USART_Number, USART_TDATA_REG_EMPTY, &FlagState);
			}

			USART[Config->USART_Number]->DR = DataBuffer[0];

