Aymann00/STM32F446xx-Drivers/MCAL/USART/Src/USART_Program.c
			/* Enable Transfer Complete Interrupt */
			USART[Config->USART_Number]->CR1 |= (1 << TRANS_CIE);
		}
		else
		{
			Local_u8ErrorStatus = NULL_POINTER;
		}
	}
	else
	{
		Local_u8ErrorStatus = USART_NOK;
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Receive a Buffer of Data Using a USART Peripheral ( Non-Blocking Mode ) AKA Asycnchronous
 * @fn     : USART_ReceiveBuffer_IT
 * @param  : Config => This Parameter is Used to Pass The Configuration Struct to Receive Buffer Using it
 * @param  : ReceiveBuffer => This Parameter is Used to Pass The Buffer of Data to Be Received inside it Using The USART Peripheral
 * @param  : BufferSize => This Parameter is Used to Pass The Size of The Buffer to Be Received Using The USART Peripheral
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
ERRORS_t USART_ReceiveBuffer_IT(USART_Config_t *Config, uint8_t *ReceiveBuffer, uint8_t BufferSize, void(*pv_CallBackFunc))
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

	if (USART_WRONG_CONFIGURATION != USART_CheckConfig(Config))
	{
		if (ReceiveBuffer != NULL && pv_CallBackFunc != NULL)
		{
			/* Set IRQ Source */
			IRQ_SRC[Config->USART_Number] = USART_RECEIVE_BUFFER;

			/* Setting Buffer Size globally */
			USART_ReceivebufferSize[Config->USART_Number] = BufferSize;

			/* Setting Buffer to Receive globally */
			USART_ReceivedBuffer[Config->USART_Number] = ReceiveBuffer;

			/* Setting Call Back Function */
			USART_PTR_TO_FUNC[Config->USART_Number][USART_IT_RXNE] = pv_CallBackFunc;

			/* Enable Receive Data Register Not Empty Interrupt */
			USART[Config->USART_Number]->CR1 |= (1 << RXNEIE);
		}
		else
		{
			Local_u8ErrorStatus = NULL_POINTER;
		}
	}
	else
	{
		Local_u8ErrorStatus = USART_NOK;
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Check The Configuration of USART Peripheral
 *
 * @param  : Config => This Parameter is Used to Pass The Configuration Struct to Check it
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
static ERRORS_t USART_CheckConfig(USART_Config_t *Config)
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

	if (Config->Mode < USART_Rx || Config->Mode > USART_Rx_Tx ||
		Config->USART_Number < USART_PERIPH_1 || Config->USART_Number > USART_PERIPH_6 ||
		Config->WordLength < USART_8_BITS_WIDTH || Config->WordLength > USART_9_BITS_WIDTH ||
		Config->Oversampling < USART_OVER16 || Config->Oversampling > USART_OVER8 ||
		Config->ParityMode < USART_PARITY_DIS || Config->ParityMode > USART_PARITY_EN_ODD ||
		Config->IT_FlagEnable.ParityErrorIT < USART_IT_FLAG_DIS || Config->IT_FlagEnable.ParityErrorIT > USART_IT_FLAG_EN ||
		Config->IT_FlagEnable.TDataRegEmptyIT < USART_IT_FLAG_DIS || Config->IT_FlagEnable.TDataRegEmptyIT > USART_IT_FLAG_EN ||
		Config->IT_FlagEnable.TransmissionCompleteIT < USART_IT_FLAG_DIS || Config->IT_FlagEnable.TransmissionCompleteIT > USART_IT_FLAG_EN ||
		Config->IT_FlagEnable.RDataRegNEmptyIT < USART_IT_FLAG_DIS || Config->IT_FlagEnable.RDataRegNEmptyIT > USART_IT_FLAG_EN ||
		Config->IT_FlagEnable.IDLELineDetectedIT < USART_IT_FLAG_DIS || Config->IT_FlagEnable.IDLELineDetectedIT > USART_IT_FLAG_EN ||
		Config->IT_FlagEnable.CTSIT < USART_IT_FLAG_DIS || Config->IT_FlagEnable.CTSIT > USART_IT_FLAG_EN ||
		Config->IT_FlagEnable.ErrorIT < USART_IT_FLAG_DIS || Config->IT_FlagEnable.ErrorIT > USART_IT_FLAG_EN ||
		Config->IT_FlagEnable.LINBreakDetectedIT < USART_IT_FLAG_DIS || Config->IT_FlagEnable.LINBreakDetectedIT > USART_IT_FLAG_EN ||
		Config->StopBits < USART_ONE_SB || Config->StopBits > USART_ONE_AND_HALF_SB)
	{
		Local_u8ErrorStatus = USART_WRONG_CONFIGURATION;
	}

	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Set The BaudRate of USART Peripheral
 *
 * @param  : Config => This Parameter is Used to Pass The Configuration Struct to Set The BaudRate
 * @return : void
 */
static void USART_SetBaudRate(USART_Config_t *Config)
{
	float USART_DIV = 0;

	uint32_t DIV_Fraction = 0;

	USART[Config->USART_Number]->BRR = 0;

	/* BaudRate Equation */
	USART_DIV = F_PCLK / (float)(8U * (2U - Config->Oversampling) * Config->BaudRate);
	USART_DIV *= 1000UL;

	/* Set the Mantissa Part */
	USART[Config->USART_Number]->BRR |= ((uint32_t)USART_DIV / 1000UL) << DIV_MANTISSA;

	/* Calculte the Fraction */
	DIV_Fraction = (uint32_t)USART_DIV % 1000UL;

	DIV_Fraction = DIV_Fraction * (16 / (Config->Oversampling + 1));

	/* get Round */
	DIV_Fraction += 500UL;

	USART[Config->USART_Number]->BRR |= (uint32_t)(DIV_Fraction / 1000UL) << DIV_FRACTION;
}

/**
 * @brief  : This Function is Used to Set The Parity Mode of USART Peripheral
 *
 * @param  : UsartNum => This Parameter is Used to Select The USART Peripheral Number to Be Used -> @USART_t
 * @param  : Parity   => This Parameter is Used to Select The Parity Mode to Be Used -> @USART_ParityMode_t
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
static ERRORS_t USART_SetParity(USART_t UsartNum, USART_ParityMode_t Parity)
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

	if (UsartNum < USART_PERIPH_1 || UsartNum > USART_PERIPH_6 ||
		Parity < USART_PARITY_DIS || Parity > USART_PARITY_EN_ODD)
	{
		Local_u8ErrorStatus = USART_NOK;
	}
	else
	{
		switch (Parity)
		{
		case USART_PARITY_DIS:
			USART[UsartNum]->CR1 &= (~(1 << PCE));
			break;
		case USART_PARITY_EN_EVEN:
			USART[UsartNum]->CR1 |= (1 << PCE);
			USART[UsartNum]->CR1 &= (~(1 << PS));
			break;
		case USART_PARITY_EN_ODD:
			USART[UsartNum]->CR1 |= (1 << PCE);
			USART[UsartNum]->CR1 |= (1 << PS);
			break;
		}
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Set The Mode of USART Peripheral
 *
 * @param  : UsartNum => This Parameter is Used to Select The USART Peripheral Number to Be Used -> @USART_t
 * @param  : Mode     => This Parameter is Used to Select The Mode to Be Used -> @USART_Mode_t
 * @return : ERRORS_t => This Return Parameter is Used to Indicate The Function Execution If Executed Correctly or NOT
 */
static ERRORS_t USART_SetMode(USART_t UsartNum, USART_Mode_t Mode)
{
	ERRORS_t Local_u8ErrorStatus = USART_OK;

