Aymann00/STM32F446xx-Drivers/MCAL/USART/Src/USART_Program.c
	if (UsartNum < USART_PERIPH_1 || UsartNum > USART_PERIPH_6 ||
		Mode < USART_Rx || Mode > USART_Rx_Tx)
	{
		Local_u8ErrorStatus = USART_NOK;
	}
	else
	{
		switch (Mode)
		{
		case USART_Rx:
			USART[UsartNum]->CR1 &= (~(1 << TE));
			USART[UsartNum]->CR1 |= (1 << RE);
			break;
		case USART_Tx:
			USART[UsartNum]->CR1 &= (~(1 << RE));
			USART[UsartNum]->CR1 |= (1 << TE);
			break;
		case USART_Rx_Tx:
			USART[UsartNum]->CR1 |= (1 << TE);
			USART[UsartNum]->CR1 |= (1 << RE);
			break;
		}
	}
	return Local_u8ErrorStatus;
}

/**
 * @brief  : This Function is Used to Handle The Interrupts of USART Peripheral
 * @fn	   : USART_HANDLE_IT
 * @param  : USARTNum => This Parameter is Used to Select The USART Peripheral Number to Be Used -> @USART_t
 * @return : void
 * @note   : This Function is Used Inside All IRQ Handlers to Handle The Interrupts ( Private Function )
 */
static void USART_HANDLE_IT(USART_t USARTNum)
{
	USART_FlagStatus_t FlagState = USART_FLAG_RESET;

	/* Read Data Register Not Empty Flag */
	USART_ReadFlag(USARTNum, USART_RDATA_REG_NEMPTY, &FlagState);

	if (FlagState == USART_FLAG_SET && IRQ_SRC[USARTNum] == USART_RECEIVE_DATA)
	{
		/* Clearing IRQ Source */

		IRQ_SRC[USARTNum] = USART_NO_SRC;

		/* Setting Received Data */
		*USART_ReceivedData[USARTNum] = USART[USARTNum]->DR;

		/* Disable Receive Data Register Not Empty Intterupt */
		USART[USARTNum]->CR1 &= (~(1 << RXNEIE));

		/* Invoke the Call Back Function */
		if (USART_PTR_TO_FUNC[USARTNum][USART_IT_RXNE] != NULL)
		{
			USART_PTR_TO_FUNC[USARTNum][USART_IT_RXNE]();
		}
	}
	else if (FlagState == USART_FLAG_SET && IRQ_SRC[USARTNum] == USART_RECEIVE_BUFFER)
	{
		static uint8_t Local_u8Counter = 0;

		/* Setting Received Data */
		USART_ReceivedBuffer[USARTNum][Local_u8Counter++] = USART[USARTNum]->DR;

		if (Local_u8Counter == USART_ReceivebufferSize[USARTNum])
		{
			/* clear IRQ Source */
			IRQ_SRC[USARTNum] = USART_NO_SRC;

			/* Disable Receive Data Register Not Empty Intterupt */
			USART[USARTNum]->CR1 &= (~(1 << RXNEIE));

			/* Invoke the Call Back Function */
			if (USART_PTR_TO_FUNC[USARTNum][USART_IT_RXNE] != NULL)
			{
				USART_PTR_TO_FUNC[USARTNum][USART_IT_RXNE]();
			}
		}
	}

	FlagState = USART_FLAG_RESET;

	/* Transmission Complete Flag */
	USART_ReadFlag(USARTNum, USART_TRANSMISSION_COMP, &FlagState);

	if (FlagState == USART_FLAG_SET && IRQ_SRC[USARTNum] == USART_SEND_BUFFER)
	{
		static uint8_t Local_u8counter = 1;

		/* Send Next Data */
		USART[USARTNum]->DR = USART_SentBuffer[USARTNum][Local_u8counter++];

		if (Local_u8counter == USART_SentbufferSize[USARTNum])
		{
			/* Clear IRQ Source */
			IRQ_SRC[USARTNum] = USART_NO_SRC;

			/* Disable Transmission Complete Interrupt */
			USART[USARTNum]->CR1 &= (~(1 << TRANS_CIE));

			/* Invoke Call Back Function */
			if (USART_PTR_TO_FUNC[USARTNum][USART_IT_TC] != NULL)
			{
				USART_PTR_TO_FUNC[USARTNum][USART_IT_TC]();
			}
		}
	}
	else if (FlagState == USART_FLAG_SET && IRQ_SRC[USARTNum] == USART_SEND_DATA)
	{
		/* Clear IRQ Source */
		IRQ_SRC[USARTNum] = USART_NO_SRC;

		/* Disable Transmission Complete Interrupt */
		USART[USARTNum]->CR1 &= (~(1 << TRANS_CIE));

		/* Invoke Call Back Function */
		if (USART_PTR_TO_FUNC[USARTNum][USART_IT_TC] != NULL)
		{
			USART_PTR_TO_FUNC[USARTNum][USART_IT_TC]();
		}
	}
}

/*==============================================================================================================================================
 * INTERRUPT HANDLERS IMPLEMENTATION
 *==============================================================================================================================================*/

/* USART1 Interrupt Handler */
void USART1_IRQHandler(void)
{
	USART_HANDLE_IT(USART_PERIPH_1);
}

/* USART2 Interrupt Handler */
void USART2_IRQHandler(void)
{
	USART_HANDLE_IT(USART_PERIPH_2);
}

/* USART3 Interrupt Handler */
void USART3_IRQHandler(void)
{
	USART_HANDLE_IT(USART_PERIPH_3);
}

/* UART4 Interrupt Handler */
void UART4_IRQHandler(void)
{
	USART_HANDLE_IT(UART_PERIPH_4);
}

/* UART5 Interrupt Handler */
void UART5_IRQHandler(void)
{
	USART_HANDLE_IT(UART_PERIPH_5);
}

/* USART6 Interrupt Handler */
void USART6_IRQHandler(void)
{
	USART_HANDLE_IT(USART_PERIPH_6);
}
